app/views/messages/index.json.jbuilder

  json.image       message.image
  json.created_at  message.created_at.strftime("%Y/%m/%d %H:%M")
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('紳士になりたいとオッぺんぺんは言った。', 5, 2, '2019-03-24 12:37:14', '2019-03-24 12:37:14')