app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('変態紳士', '2019-03-16 05:07:55', '2019-03-16 05:07:55')

  def set_group
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1