app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 2 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2
SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
    respond_to do |format|
      format.json { @newmessages = @group.messages.where("id > ?", params[:id]) }

INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('紳士であるものを集う', 2, 1, '2019-03-16 05:23:54', '2019-03-16 05:23:54')
---
  def create
    @message = @group.messages.new(message_params)
    @message.user = current_user
    if @message.save

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
---
  def set_group
    @group = Group.find(params[:group_id])