app/controllers/users_controller.rb

UPDATE `users` SET `name` = 'DT', `updated_at` = '2019-03-16 06:18:14' WHERE `users`.`id` = 3
---
  def update
    if current_user.update(user_params)

SELECT `users`.* FROM `users` WHERE (name LIKE('%a%') and id != (1))
---
  def index
    @users = User.where('name LIKE(?) and id != (?)', "%#{params[:keyword]}%" ,current_user)